# Из колоды в 52 карты извлекаются случайным образом 4 карты. 
# a) Найти вероятность того, что все карты – крести. 

import math

m = math.comb(13, 4)
print('Число сочетаний по 4 карты из всех карт крестей:', m) # m = 715

n = math.comb(52, 4)
print('Число сочетаний по 4 карты из 52 карт:', n) # n = 270725

P = m / n
print('Вероятность того, что все 4 карты – крести:', round(P, 4)) # P = 0.0026

# б) Найти вероятность, что среди 4-х карт окажется хотя бы один туз.

# Событие А - среди 4-х карт есть хотя бы один туз. 
# Тогда противоположное событие А‾ - среди 4-х карт нет ни одного туза

m = math.comb(48, 4)
print('Число сочетаний по 4 карты из колоды в 48 карт, в которой нет тузов:', m) # m = 194580

n = math.comb(52, 4)
print('Число сочетаний по 4 карты из 52 карт:', n) # n = 270725

P = 1 - m / n
print('Вероятность того, что среди 4-х карт окажется хотя бы один туз:', round(P, 4)) # P = 0.2813

########################################################################################################

# На входной двери подъезда установлен кодовый замок, содержащий десять кнопок с цифрами от 0 до 9. 
# Код содержит три цифры, которые нужно нажать одновременно. 
# Какова вероятность того, что человек, не знающий код, откроет дверь с первой попытки?

P = 1 / math.comb(10, 3)
print(round(P, 4)) # P = 0.0083

########################################################################################################

# В ящике имеется 15 деталей, из которых 9 окрашены. 
# Рабочий случайным образом извлекает 3 детали. 
# Какова вероятность того, что все извлеченные детали окрашены?

m = math.comb(9, 3)
print('Число сочетаний по 3 детали из 9 окрашенных деталей:', m) # m = 84

n = math.comb(15, 3)
print('Число сочетаний по 3 детали из всех 15 деталей:', n) # n = 455

P = m / n
print('Вероятность того, что все извлеченные детали окрашены:', round(P, 4)) # P = 0.1846

########################################################################################################

# В лотерее 100 билетов. Из них 2 выигрышных. 
# Какова вероятность того, что 2 приобретенных билета окажутся выигрышными?

m = 1 # Один благоприятствующий исход, когда взяты 2 выигрышных билета
print('Число исходов, благоприятствующих выигрышу:', m)

n = math.comb(100, 2)
print('Число сочетаний по 2 билета из всех 100 билетов:', n) # n = 4950

P = m / n
print('Вероятность того, что 2 приобретенных билета выигрышные:', round(P, 4)) # P = 0.0002